{
  "main": {
    "home": "Home",
    "about": "About",
    "projects": "Projects",
    "books": "Blog",
    "certifications": "Certifications",
    "startups": "Startups"
  },
  "footer": {
    "my-setup": "My dotfiles",
    "sourcecode": "Source code",
    "contact": "Contact",
    "analytics": "Analytics",
    "sitemap": "Sitemap",
    "powered": "Powered by ",
    "and": "and ",
    "hosted": "Hosted on "
  },
  "index-page": {
    "title": "Data Analyst & Aspiring Data Engineer",
    "intro": "Experienced in cloud-based analytics, ETL pipeline development, and business intelligence. Building dashboards, data pipelines, and automating workflows that drive data-driven decisions.",
    "posts": {
      "read-all": "View all posts",
      "1": {
        "title": "M2 MacBook Pro Dev Setup",
        "slug": "m2-macbook-pro-dev-setup"
      }
    }
  },
  "about-page": {
    "text-1": "Hey, I'm Daniel. I'm a data analyst with experience in cloud-based analytics, ETL pipeline development, and business intelligence. I'm passionate about turning data into actionable insights that drive operational decisions across healthcare and business environments.",
    "text-2": "I graduated from the University of Maryland with a Bachelor of Science in Computer Science (GPA: 3.5) in August 2025. During my studies, I developed strong foundations in algorithms, software engineering, statistics, data science, and data visualization.",
    "text-3": "I'm proficient in SQL optimization, Python-based data processing, and creating dashboards using Power BI and Tableau. I've worked with modern data stack tools like dbt, AWS, and Snowflake to build robust data pipelines.",
    "website": "Website",
    "tools": {
      "title": "Tools",
      "text": "These are the tools I use daily for data analysis and building data pipelines. I'm always exploring new technologies to improve my workflow.",
      "python": "My primary language for data processing, analysis, and automation. I use Pandas, NumPy, and scikit-learn extensively.",
      "sql": "Essential for data extraction and transformation. I work with MySQL, PostgreSQL, and optimize complex queries for performance.",
      "powerbi": "My go-to tool for creating interactive dashboards and business intelligence reports connected to various data sources.",
      "aws": "I use AWS services like Glue, Lambda, and EC2 for building scalable ETL pipelines and deploying data applications."
    },
    "uses": {
      "title": "My Gear",
      "text": "Here's what tech I'm currently using for data analysis and development.",
      "office": "Workstation",
      "other-tech": "Other tech",
      "and": "and",
      "configuration": "Configuration"
    },
    "timeline": {
      "title": "Timeline",
      "learn-more": "Learn more",
      "1": {
        "date": "August 2025",
        "title": "Graduated from University of Maryland",
        "description": "Completed Bachelor of Science in Computer Science with a 3.5 GPA. Coursework included Algorithms, Software Engineering, Statistics, Data Science, and Data Visualization."
      },
      "2": {
        "title": "Data Analytics Consultant at ICATT Consulting",
        "description": "Designed and implemented ETL workflows using AWS Glue & Lambda. Built real-time Power BI dashboards connected to Snowflake. Implemented dbt data quality checks to ensure reporting pipeline integrity."
      },
      "3": {
        "title": "Data Analyst Intern at University of Maryland Career Center",
        "description": "Automated weekly employment reports using Python and SQL. Analyzed student placement data in MySQL to identify hiring trends. Improved database query performance by 3x through optimization. Built Tableau dashboards for career fair analytics."
      }
    }
  },
  "404": {
    "title": "Page not found",
    "description": "Why show a generic 404 when I can make it sound mysterious? It seems you've found something that used to exist, or you spelled something wrong. I'm guessing you spelled something wrong. Can you double check that URL?",
    "return-home": "Return Home"
  },
  "error": {
    "title": "Something went wrong",
    "description": "I'm sorry, but something went wrong. Please try again later.",
    "return-home": "Return home"
  },
  "blog": {
    "description": "Technical articles and guides about data analysis, machine learning, software engineering, and technology. In total, I've written {amount} posts. Use the search below to filter by title.",
    "no-posts": "No posts found.",
    "all-posts": "All Posts",
    "search": "Search",
    "filter": {
      "by-name": "By name",
      "by-tag": "By tag"
    },
    "views": "views",
    "reading-time": "{minutes} min read"
  },
  "guestbook": {
    "title": "Guestbook",
    "login": "Sign in with ",
    "logout": "Sign out",
    "form": {
      "title": "Sign the Guestbook",
      "description": "Share a message for a future visitor of my site.",
      "input": "Your message...",
      "submit": "Send",
      "info": "Your information is only used to display your name."
    },
    "success": "Hooray! Thanks for signing my Guestbook.",
    "error": "Please enter a message.",
    "delete": "Delete"
  },
  "dashboard": {
    "unauthorized": "You are not authorized to view this page.",
    "logout": "Sign out",
    "logged-in": "Logged in as",
    "stats": "Stats",
    "top-tracks": "Top Spotify Tracks",
    "metrics": {
      "blog-views": "Blog views",
      "guestbook-entries": "Guestbook entries",
      "posts-count": "Amount of all posts (EN)"
    }
  },
  "projects": {
    "not-found": "No projects found",
    "see-more": "See all projects",
    "all-repos": "All Repositories"
  },
  "not-playing": "Not Playing",
  "command-palette": {
    "settings": "Settings",
    "socials": "Socials",
    "switch-theme": "Switch theme",
    "search-placeholder": "Search...",
    "no-results": "No results"
  },
  "stats": {
    "title": "My GitHub Stats",
    "stars": "Total Stars Earned",
    "commits": "Total Commits",
    "prs": "Total PRs",
    "issues": "Total Issues",
    "contributed": "Contributed to",
    "top-languages": "Top Languages"
  },
  "certifications": {
    "title": "Certifications",
    "description": "Professional certifications and credentials I've earned to validate my technical expertise.",
    "view-credential": "View Credential",
    "coming-soon": "Coming Soon"
  },
  "startups": {
    "title": "Startups",
    "description": "Entrepreneurial ventures and startup projects I'm building or have been involved with.",
    "coming-soon-title": "Coming Soon",
    "coming-soon-description": "I'm currently working on some exciting ventures. Check back soon to see what I'm building!"
  }
}
